/**
 * resultCode
 */
var resultCode = {
		/**********************common error********************************************/
		"0": "成功",
		"1": "登录过期或未登录,请重新登录",
		"2": "未知错误",
		"3":"{1}",//提示由程序代码给出
		"10001": "参数错误",
		"10002": "保存失败",
	    
		/**********************user module************************************/
		"100001": "用户名或密码不正确",
	    "100002": "用户名已被使用",
	    "100004": "用户所属角色设置的设备展示权限不一致",
	    "100005": "不能删除系统用户",
	    "100006": "用户不存在",
	    "100008": "原始密码错误",

	    
	    
	    /*******************cp ***********************/
	    "102001": "co不能被订阅",
	    
};